chore: ci, docs & dependabot
Signed-off-by: denniskribl <denniskribl@gmail.com>
